Revit 2027 API
ExternalServices.BuiltInExternalServices.SnappingService Property
 Autodesk Internal: The service which provides snap points and lines
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId SnappingService { get; }
Public Shared ReadOnly Property SnappingService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ SnappingService {
	ExternalServiceId^ get ();
}
static member SnappingService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace